# 每个像素代表的面积转换为公顷 (1公顷 = 10,000平方米)
PIXEL_AREA_IN_HECTARES = (30 * 30) / 10000

# 水源涵养计算：不同生态系统的地表径流系数
WATER_SUPPLY_PARAM = {
    1: 0.347,  # 水田
    2: 0.01, # 林地
    3: 0.08,  # 草原
    4: 0,  # 水域
    5: 1,  # 建设用地
    6: 1,  # 未利用地
}

# 粮食生产计算：修正系数
FOOD_SUPPLY_PARAM = {
    'PODU': 0.3317,
    'GD': 0.1887,
    'WATER': 0.1592,
    'DL': 0.1297,
    'CITY': 0.1907,
}

# 像素数阈值，小于该值判断为未发生变化，不进入模拟退火过程
PIXEL_NUM_THRESHOLD_ISCHANGE = 30
# 像素数阈值，小于该值将从diff中移除
PIXEL_NUM_THRESHOLD_REMOVE = 20

ALL_PACK = [[10, 15], [15, 20], [10, 20], [-1, -1]]
# 每个pack组合对应的变换增强重复次数
ALL_PACK_TRANSFORM_REPEAT_DICT = {
    (10, 15): 6,
    (15, 20): 2,
    (10, 20): 2,
    (-1, -1): 1,
}
ALL_YEARS = ["10", "15", "20"]
ALL_FACTORS = ["DEM", "DL", "NLMY", "GDP", "RK"]

COLOR_MAP = {
    0: (0,0,0),  # non-diff
    1: (1,1,1),  # diff
    False: (0,0,0),  # non-diff
    True: (1,1,1),  # diff
    # 耕地
    11: (254/255,250/255,207/255),  # 水田
    12: (253/255,216/255,65/255),      # 旱地
    # 林地
    21: (41/255,138/255,49/255),      # 有林地
    22: (157/255,205/255,74/255),    # 灌木林
    23: (172/255,229/255,138/255),     # 疏林地
    24: (125/255,226/255,150/255),     # 其他林地
    # 草地
    31: (156/255,151/255,41/255),      # 高覆盖度草地
    32: (189/255,183/255,115/255),    # 中覆盖度草地
    33: (220/255,185/255,137/255),    # 低覆盖度草地
    # 水域
    41: (1/255,0,247/255),       # 河渠
    42: (1/255,0,247/255),       # 湖泊
    43: (1/255,0,247/255),       # 水库坑塘
    44: (229/255,230/255,248/255),   # 永久性冰川雪地
    45: (68/255,104/255,220/255),   # 滩涂
    46: (38/255,125/255,248/255),     # 滩地
    # 城乡、工矿、居民用地
    51: (251/255,103/255,78/255),       # 城镇用地
    52: (252/255,142/255,45/255),       # 农村居民点
    53: (236/255,131/255,129/255),       # 其他建设用地
    # 未利用地
    61: (179/255,152/255,186/255),   # 沙地
    62: (129/255,124/255,182/255),   # 戈壁
    63: (152/255,51/255,197/255),   # 盐碱地
    64: (147/255,113/255,214/255),   # 沼泽地
    65: (183/255,89/255,206/255),   # 裸土地
    66: (184/255,88/255,208/255),   # 裸岩石质地
    67: (253/255,192/255,204/255),      # 其他
}

FACTOR_10_PARAMS_DICT={
    "DEM": {
        "miu": 1.0814407780597586,
        "epsilon": 1.788031763345373
    },
    "DL": {
        "miu": 2.522156872482891,
        "epsilon": 1.187615531096033
    },
    "GDP": {
        "miu": 7.693943775452838,
        "epsilon": 0.8684736515245268
    },
    "RK": {
        "miu": 1.0299328146645907,
        "epsilon": 0.7987507497713701
    }
}
FACTOR_15_PARAMS_DICT={
    "DEM": {
        "miu": 1.0814430603217478,
        "epsilon": 1.788033743629245
    },
    "DL": {
        "miu": 2.3430028285064752,
        "epsilon": 1.0569192558795943
    },
    "GDP": {
        "miu": 8.01455241977147,
        "epsilon": 0.8878913056045725
    },
    "RK": {
        "miu": 0.9983773746635167,
        "epsilon": 0.8456885410728755
    }
}
FACTOR_20_PARAMS_DICT={
    "DEM": {
        "miu": 1.0814407780597586,
        "epsilon": 1.788031763345373
    },
    "DL": {
        "miu": 1.6398164592274322,
        "epsilon": 0.8869015324486094
    },
    "GDP": {
        "miu": 8.468035998360396,
        "epsilon": 0.5520970106850966
    },
    "RK": {
        "miu": 1.029140928244634,
        "epsilon": 0.8556354944383957
    }
}

# 标准化中所有需要进行对数变换的因子
ALL_LOG_FACTORS = ["GDP", "RK", "DL"]

# 每个年份不同因子的归一化参数字典
FACTOR_PARAMS_DICT={
    "10": FACTOR_10_PARAMS_DICT,
    "15": FACTOR_15_PARAMS_DICT,
    "20": FACTOR_20_PARAMS_DICT,
}

# 原始数据根目录, 保存着tif文件配套的tfw等文件
# 若需要frg模型评估方案, 则待评估方案需要从此处复制tfw文件
RAW_DATA_ROOT = 'D:\\_programming\\_LAB_ASSIGMENTS\\AAAAA栅格分割'

FACTORS_NAME_DICT = {
    'RA': '耕地红线(不可变更)',
    'DEM': '海拔',
    'DL': '距道路距离',
    'NLMY': '农林牧渔产值',
    'GDP': '人均生产总值',
    'RK': '人口密度',
    'RAIN': '年均降水',
    'NJW': '年均气温',
    'ZSL': '年均蒸散量',
    'PODU': '坡度',
    'WATER': '距水源距离',
    'CITY': '距城市距离',
    'GD': '距农田距离',
}